cf/BusinessProcesses/СборкаТовара.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<BusinessProcess>
		<Properties>
			<Name>СборкаТовара</Name>
			<Task>Task.ЗадачаПользователю</Task>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВнутреннийЗаказ</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнтернетЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СборочныйЛист</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СборочныйЛист</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</BusinessProcess>
</MetaDataObject>

cf/Enums/СостоянияЗаказа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>СостоянияЗаказа</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВОчередиНаСборку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВОчередиНаСклад</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВОчередиНаСкладПовторно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжидаетПеремещения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжиданиеОплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжиданиеОтвета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжиданиеПодтверждения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отгружен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтгруженЧастично</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Открыт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перемещается</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Собирается</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Собран</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СобранЧастично</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Черновик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОформитьЗаявку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринятьИнструмент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СогласоватьГарантию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизвестиДефектовку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередатьНаСкладВыдачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередатьКлиенту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПредупредитьКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СогласоватьСКлиентом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Принят</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринятЧастично</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВПути</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВПутиЧастично</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтклоненПоТехническимПричинам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаСогласовании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Редактируется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отправлен</Name>
					<Comment>Когда товар отправлен в доставку</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправленЧастично</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доставлен</Name>
					<Comment>Когда товар принял получатель или транспортная компания</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоставленЧастично</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/Enums/ВариантДоставки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВариантДоставки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СамовывозСНашегоСклада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоставкаДоКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоставкаДоГрузоперевозчика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоставкаДоКлиентаНашимиСилами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СамовывозСоСкладаПоставщика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СамовывозСТерминала</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоставкаДоСкладаТК</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоставкаДоСкладаПоставщиком</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/BusinessProcesses/СборкаТовара/Ext/ObjectModule.bsl
Процедура УстановитьЗадачеРеквизитыПоУмолчанию(ФормируемыеЗадачи)
	
	Для Каждого Задача Из ФормируемыеЗадачи Цикл
		
		Задача.Наименование = ФункцииБизнесПроцессов.ПредставлениеЗадачиПоЗаказу(Задача, Заказ);
		Задача.Склад 		= Ссылка.Склад;
		Задача.Заказ 		= Заказ; КонецЦикла;
	
КонецПроцедуры


Процедура СобратьЗаказПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	УстановитьЗадачеРеквизитыПоУмолчанию(ФормируемыеЗадачи);
	
	// Установим статус
	
	Если Не Заказы.УстановитьСостояниеЗаказа(Заказ, Перечисления.СостоянияЗаказа.ВОчередиНаСборку) Тогда
		Отказ = Истина КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ТипЗнч = ТипЗнч(ДанныеЗаполнения);
	
	Если ТипЗнч = Тип("Структура") Тогда
		
		КонвертацияТипов.ЗаполнитьОбъектПоСтруктуреОснованию(ЭтотОбъект, ДанныеЗаполнения); КонецЕсли;
	
КонецПроцедуры

Функция ЭтоПоследняяСборка()
	
	Возврат Заказ.Склад = Склад;
	
КонецФункции

Процедура ВыполнитьСкорректироватьЗаказ(ТочкаМаршрутаБизнесПроцесса)
	// Если это последний склад сборки тогда выполнить задачу скорректировать за логиста
	
	Запрос = Новый Запрос("
	
	// Проверим что это последняя задача
	
	|ВЫБРАТЬ 	Ссылка Задача
	|ИЗ			Задача.ЗадачаПользователю 
	|ГДЕ 		Не Выполнена И
	|			БизнесПроцесс.Заказ = &Заказ И
	|			ТочкаМаршрута 		= &ТочкаСкорректировать И
	|			Склад 				= &Склад");
	
	Запрос.УстановитьПараметр("Заказ", Заказ);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("ТочкаСкорректировать", БизнесПроцессы.СборкаЗаказа.ТочкиМаршрута.СкорректироватьЗаказ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл Выборка.Задача.Получитьобъект().ВыполнитьЗадачу() КонецЦикла;	
	
КонецПроцедуры

Процедура ЭтоПоследняяСборкаПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	
	Результат = ЭтоПоследняяСборка();
	
КонецПроцедуры

Процедура ЗакрытьСборкиОбработка(ТочкаМаршрутаБизнесПроцесса)
	
	ВОЗВРАТ; // пока не понимаю как правильно
	
	// Закрываем сборки которые не собирались, чтобы не висели товары в сборке
	
	Если Не БизнесПроцессы.СборкаЗаказа.СоздатьСборочныйЛистКоторыйЗакроетСборкуЗаказа(Заказ, Склад) Тогда
		ВызватьИсключение "Ошибка создания отмены сборочного листа"; КонецЕсли;
	
КонецПроцедуры

//Нэти Исмаилов ИТ 23.03.2017 Начало
Процедура ОтправкаПисьмаОбработка(ТочкаМаршрутаБизнесПроцесса)
	
	Если ТипЗнч(Заказ) = Тип("ДокументСсылка.ИнтернетЗаказПокупателя") и Не ЗначениеЗаполнено(Заказ.МВЗ) Тогда
		
		Если Заказы.ЗаказПолностьюСобран(Ссылка,Заказ.Склад) Тогда
			Если Заказ.ВариантДоставкиНов = Перечисления.ВариантДоставки.ДоставкаДоГрузоперевозчика
				Или Заказ.ВариантДоставкиНов = Перечисления.ВариантДоставки.ДоставкаДоКлиента Тогда
				
				ТекстПисьма = "	Ваш заказ #" + СокрЛП(Заказ.Номер) + " собран и готов к отправке в транспортную компанию.<BR>";
				БизнесПроцессы.ИнтернетЗаявка.СформироватьПисьмо_Нов(Заказ, """Гараж Тулс"". Готов заказ", ТекстПисьма,,,,, "Готов к отправке");
				
			ИначеЕсли Заказ.ВариантДоставкиНов = Перечисления.ВариантДоставки.СамовывозСНашегоСклада Тогда
				
				ТекстПисьма = "	Ваш заказ #" + СокрЛП(Заказ.Номер) + " собран и готов к отгрузке.<BR>";
				БизнесПроцессы.ИнтернетЗаявка.СформироватьПисьмо_Нов(Заказ, """Гараж Тулс"". Готов заказ", ТекстПисьма,,,,, "Готов к отгрузке");
				
			ИначеЕсли Заказ.ВариантДоставкиНов = Перечисления.ВариантДоставки.ДоставкаДоКлиентаНашимиСилами Тогда
				
				ТекстПисьма = "	Ваш заказ #" + СокрЛП(Заказ.Номер) + " собран и готов к доставке.<BR>";
				БизнесПроцессы.ИнтернетЗаявка.СформироватьПисьмо_Нов(Заказ, """Гараж Тулс"". Готов заказ", ТекстПисьма,,,,, "Готов к доставке");

			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

//Нэти Исмаилов ИТ 23.03.2017 Конец
